def Data_Class ():
    Subject = input ("ชื่อนิสิต: ") #รับชื่อนิสิตด้วย input 
    Subject_Count = 0   #สร้างตัวแปลมารับค่า ตัวแปลนี้ จะทำการนับรอบที่วนรูป 
    total_credits = 0   #สร้างตัวแปลไว้รวมหน่วยกิต
    subject = {     "programming":3, #สร้าง list ของตัวเองมา
                "digital":3,
                "physic":3,
                "calculus":3,
                "chemical":3,
                "biology":3,
                "marketing":2,
                "ethics":2,
                "english":2,
                "chinese":2,
                "football":2,
                "badminton":2,
                "softball":2
        }
    Subjecta = input("กรุณากรอกรายชื่อวิชา: ")  #รับชื่อรายวิชา 
    while Subjecta != "end":  # สร้างลูป while ถ้า Subjecta มีค่า ไม่เท่ากับ End จะทำการลุปภายในวงเล็ป
        print (f"วิชา :{Subjecta}") # ปริ้นชื่อวิชาที่รับ ชื่อจากบันทัดที่ 19
        if Subjecta in subject:#สร้างเงื่อนไข ถ้าตัวแปล Subjecta เขียนชื่่อ เหมือนใน list ที่อยุ่ในช่อง 5 เงื่อนไขจะทำงาน
            print(f"รายวิชา{Subjecta}")#ปริ้นชื่อรายวิชา ตัวแปลนี้รับค่าได้ 2 ค่า ถ้าตอน input ตอนครั้งแรกเลือก รายวิชาที่อยุ่ ใน list จะทำการ ปริ้นชื่อตัวแปลที่อยู่ในบันทัด 19ออกมา แต่ถ้าตอนแรกเลือกรายการที่ไม่อยู่ใน list จะทำการ ปริ้นตัวแปลที่อยู่ในบันทัด 30 ออกมา 
            Subject_Count = Subject_Count+1 #ทำการรับค่า คือทุกๆ 1 ลุปตัวเลขจะเพิ่มเลื่อยๆ แล้วจะได้เอาไปใช้ที่บันทัด ที่ 3 แต่ต้องรอให้ มีคน input end ก่อน
            total_credits += subject[Subjecta] #ทำการ เพิ่มหน่วยกิตที่รวม หมายความว่า subject[Subjecta] คือ การหาค่า ตัวแปลที่อยู่ใน list ผ่านการ [Subjecta] ที่ทำการประกาศไปตรงบันทัดที่ 30 หรือ 19 แล้วทำการวนรูปรวมค่าหน่วยกิตที่อยู่ในนั้น
        else:
            {
             print(f"ไม่มีรายวิชา{Subjecta}") 
            }
        Subjecta = input("กรุณากรอกรายชื่อวิชา: ")
    return Subject_Count, total_credits  #ทำการส่งค่าทั้งหมดที่ ได้กลับไป Subject_Count, total_credits
a, b = Data_Class() #ตรงนี้ยังงงๆ อยู่ ไม่รู้ว่าตัวแปล a กับ  b รู้ได้ไงว่าต้องการ ให้นับรอบกับ หาหน่วยกิต
print(f"นิสิตลงทะเบียนเรียนวิชาทั้งหมด {a} วิชา")
print(f"รวมคะแนนหน่วยกิตทั้งหมด: {b} หน่วยกิต")


    
   
    
    
